InformationRegisters/ЦеныТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ЦеныТоваров</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныТоваров/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура Печать(Команда)
	ПечатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПечатьНаСервере()
    ТабДок = Новый ТабличныйДокумент;
    ТабДок.ТолькоПросмотр = Истина;
    ТабДок.АвтоМасштаб = Истина;
    //ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
   
    //Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");
	
	Объект1 = РеквизитФормыВЗначение("Объект");
    Макет = Объект1.ПолучитьМакет("Макет");
       
    ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("Шапка");
   
    ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("Строка");
   
    Табдок.Вывести(ОбластьШапкаТаблицы);
   
    // Заполнение таблицы
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        | ЦеныТоваров.Товар,
        | ЦеныТоваров.Цена
        |ИЗ
        | РегистрСведений.ЦеныТоваров КАК ЦеныТоваров";
       
    РезультатЗапроса = Запрос.Выполнить();   
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
   
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        ОбластьСтрокаТаблицы.Параметры.Товар = ВыборкаДетальныеЗаписи.Товар;
        ОбластьСтрокаТаблицы.Параметры.Цена = ВыборкаДетальныеЗаписи.Цена;
        ТабДок.Вывести(ОбластьСтрокаТаблицы);
	КонецЦикла; 
    ТабДок.Показать();           
//    Возврат ТабДок;
//КонецФункции
КонецПроцедуры
